Нашей компании нужно сгруппировать клиентов для АБ-тестов. Алгоритм группировки очень простой - взять ID клиента (состоит из 5-7 цифр, например 7412567) и найти сумму всех его цифр. Получившееся число и является номером группы, в которую входит данный клиент.
Для того, чтобы понять, насколько хорош такой простой алгоритм, тебе нужно написать следующие диагностические функции:
1.	Функция, которая подсчитывает число покупателей, попадающих в каждую группу, если нумерация ID сквозная и начинается с 0. На вход функция получает целое число n_customers (количество клиентов).
2.	Функция, аналогичная первой, если ID начинается с произвольного числа. На вход функция получает целые числа: n_customers (количество клиентов) и n_first_id (первый ID в последовательности).
Напишите код функций на Python и оформите его в репозиторий Github. В форму ответа вставьте ссылку на репозиторий, убедитесь, что он публичный. 
Дополнительно к работоспособности оценим:
•	читабельность и аккуратность кода;
•	производительность кода.

In [254]:
import pandas as pd
import numpy as np

Создаем проверочный датасет

In [266]:
x = np.array([7412567, 7412569, 741256, 74125671, 7412577, 7412542, 74125, 741253, 741255])
df = pd.DataFrame(x, columns = ['ID'])
df

         ID
0   7412567
1   7412569
2    741256
3  74125671
4   7412577
5   7412542
6     74125
7    741253
8    741255

In [267]:
def group_num(x):
    b = []
    for i in x:
        a = sum([int(a) for a in str(i)])
        b.append(a)
    
    return b


df['group_number'] = df.apply(group_num)
df

         ID  group_number
0   7412567            32
1   7412569            34
2    741256            25
3  74125671            33
4   7412577            33
5   7412542            25
6     74125            19
7    741253            22
8    741255            24

## Диагностические функции

In [277]:
df1 = df.groupby(['group_number'])['ID'].count() 
df1

group_number
19    1
22    1
24    1
25    2
32    1
33    2
34    1
Name: ID, dtype: int64

Функция, которая подсчитывает число покупателей, попадающих в каждую группу, если нумерация ID сквозная и начинается с 0. На вход функция получает целое число n_customers (количество клиентов).

In [280]:
def n_customers_calc_1(n_customers):
    
          return df1[df1 == n_customers]

n_customers_by_group(2) # показывает число покупателей n_customers в группах

group_number
25    2
33    2
Name: ID, dtype: int64

Функция, аналогичная первой, если ID начинается с произвольного числа. На вход функция получает целые числа: n_customers (количество клиентов) и n_first_id (первый ID в последовательности).

In [291]:
def n_customers_calc_2(n_customers, n_first_id):
    
    df2 = df[df['ID'] >= n_first_id]   
    df2 = df2.groupby(['group_number'])['ID'].count()
    
    return df2[df2 == n_customers]


n_customers_calc_2(2, 7412542)  # показывает число покупателей n_customers в группах для ID >= n_first_id

group_number
33    2
Name: ID, dtype: int64